export default {
  header: {
    home: 'ホーム',
    projects: 'プロジェクト',
    blogs: 'ブログ',
    illust: 'イラスト',
    contact: 'コンタクト',
  },
  home: {},
  projects: {},
  blogs: {},
  page404: {
    tip1: '訪問しようとしたURLは存在しません',
    tip2: 'このURLが正しいと確信している場合は、ページが削除されたか、移動された可能性があります',
    returnButton: '👉HPに戻る👈',
  },

  components: {
    project: {},
  },

  utils: {
    devstates: {
      empty: '',
      planning: '計画中',
      developing: '開発中',
      done: 'ﾘﾘｰｽ',
      dispose: '廃棄品',
      maintainingstopped: 'ﾒﾝﾃﾅﾝｽ終止',
    },
    langs: {
      zh_cn: '簡体字',
      zh_tw: '繁体字',
      ja: '日本語',
      ko: '韓国語',
      en: '英語',
      vi: 'ベトナム語',
      id: 'インドネシア語',
      ms: 'マレー語',
    },
  },
};
